src/cf/Catalogs/уатУчетныеЗаписиСервисовГеоданных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатУчетныеЗаписиСервисовГеоданных</Name>
			<Comment>(уат)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСервиса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатТипыГеосервисов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнутреннийКлючИнтеграции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнутреннийХешИнтеграции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>APIключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйКлюч</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипАвторизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогированиеЗапросов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/уатТипыГеосервисов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатТипыГеосервисов</Name>
			<Comment>Типы геосервисов (уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Картография</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Геокодирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПостроениеМаршрутов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодсказкиАдресов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПостроениеМаршрутовЖД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Навигация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Маршрутизация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/уатУчетныеЗаписиСервисовГеоданных/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатСправочникФормаЭлементаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Объект, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ФормаЛогированиеЗапросов.Пометка = Объект.ЛогированиеЗапросов;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	уатЗащищенныеФункцииКлиент.уатСправочникФормаЭлементаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипСервисаПриИзменении(Элемент)
	Объект.ВнешняяСистема       = Неопределено;
	Объект.АдресСервиса         = "";
	Объект.APIключ              = "";
	Объект.ИдентификаторКлиента = "";
	Объект.ДополнительныйКлюч   = "";
	Объект.ТипАвторизации       = "API-ключ";
	Объект.ЛогированиеЗапросов  = Ложь;

	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ВнешняяСистемаПриИзменении(Элемент) 
	Объект.АдресСервиса         = "";
	Объект.APIключ              = "";
	Объект.ИдентификаторКлиента = "";
	Объект.ДополнительныйКлюч   = "";
	Объект.ТипАвторизации       = "API-ключ";
	Объект.ЛогированиеЗапросов  = Ложь;

	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ТипАвторизацииПриИзменении(Элемент)  
	Объект.ДополнительныйКлюч   = "";
	Объект.ИдентификаторКлиента = "";  
	
	УстановитьВидимость();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЛогированиеЗапросов(Команда)
	Элементы.ФормаЛогированиеЗапросов.Пометка = НЕ Элементы.ФормаЛогированиеЗапросов.Пометка;
	Объект.ЛогированиеЗапросов                = НЕ Объект.ЛогированиеЗапросов;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАдресПоУмолчанию(Команда)
	ВидОперации = Команда.Имя;
	
	Если ВидОперации = "ЗаполнитьПоУмолчаниюАдресКартография" Тогда 
		Если Объект.ТипСервиса = ПредопределенноеЗначение("Перечисление.уатТипыГеосервисов.Картография") Тогда
			Объект.АдресСервиса = "https://{s}.tile.openstreetmap.org/";
		ИначеЕсли Объект.ТипСервиса = ПредопределенноеЗначение("Перечисление.уатТипыГеосервисов.Геокодирование") Тогда
			Если Объект.ВнешняяСистема = ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.OSM") Тогда
				Объект.АдресСервиса = "https://nominatim.openstreetmap.org/";  
			ИначеЕсли Объект.ВнешняяСистема = ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.DaData") Тогда
				Объект.АдресСервиса = "https://cleaner.dadata.ru/";
			КонецЕсли;
			
		ИначеЕсли Объект.ТипСервиса = ПредопределенноеЗначение("Перечисление.уатТипыГеосервисов.ПодсказкиАдресов") Тогда
			Если Объект.ВнешняяСистема = ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.OSM") Тогда
				Объект.АдресСервиса = "https://nominatim.openstreetmap.org/"; 
			ИначеЕсли Объект.ВнешняяСистема = ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.DaData") Тогда
				Объект.АдресСервиса = "https://suggestions.dadata.ru/";
			КонецЕсли;
		ИначеЕсли Объект.ТипСервиса = ПредопределенноеЗначение("Перечисление.уатТипыГеосервисов.ПостроениеМаршрутовЖД") Тогда
			Если Объект.ВнешняяСистема = ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.OSM") Тогда
				Объект.АдресСервиса = "https://signal.eu.org/osm/eu/"; 
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ВидОперации = "ЗаполнитьПоУмолчаниюАдресПостроениеМаршрутов" Тогда
		Объект.АдресСервиса = "https://router.project-osrm.org/";
	ИначеЕсли ВидОперации = "ЗаполнитьПоУмолчаниюАдресПостроениеМаршрутовРарус" Тогда
		Объект.АдресСервиса = "https://maps.rarus-cloud.ru/";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПроксиСервера(Команда)
	
	ПараметрыФормы = Неопределено;
	Если ОбщегоНазначенияКлиент.ИнформационнаяБазаФайловая() Тогда
		ПараметрыФормы = Новый Структура("НастройкаПроксиНаКлиенте", Истина);
	КонецЕсли;
	
	ПолучениеФайловИзИнтернетаКлиент.ОткрытьФормуПараметровПроксиСервера(ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьOAuthтокен(Команда)
	АдресСервиса = "https://yandex.ru/routing/doc/delivery/concepts/quickstart/register.html";
	Оповещение = Новый ОписаниеОповещения("ЗапускПриложения", ЭтотОбъект);
	НачатьЗапускПриложения(Оповещение, АдресСервиса); 
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимость()
	
	Элементы.ГруппаАдресСервиса.Видимость		 = Ложь;
	Элементы.ТипАвторизации.Видимость			 = Ложь;
	Элементы.APIключ.Видимость					 = Ложь;
	Элементы.ГруппаДополнительныйКлюч.Видимость	 = Ложь;
	Элементы.ГруппаПолучитьOAuthтокен.Видимость	 = Ложь;
	Элементы.ИдентификаторКлиента.Видимость		 = Ложь;
	Элементы.ИдентификаторКлиента.Подсказка		 = ""; 
	Элементы.APIключ.ПодсказкаВвода              = "";
	Элементы.ДополнительныйКлюч.ПодсказкаВвода   = "";
	
	Элементы.ЗаполнитьПоУмолчанию.Видимость                              = Истина;
	Элементы.ЗаполнитьПоУмолчаниюАдресПостроениеМаршрутов.Видимость      = Ложь;
	Элементы.ЗаполнитьПоУмолчаниюАдресПостроениеМаршрутовРарус.Видимость = Ложь;
	Элементы.ФормаЛогированиеЗапросов.Видимость                          = Ложь;
	
	ДоступныеВнешниеСистемы = Новый Массив();
	Если Объект.ТипСервиса = ПредопределенноеЗначение("Перечисление.уатТипыГеосервисов.Картография") Тогда
		ДоступныеВнешниеСистемы.Добавить(ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.OSM"));
		ДоступныеВнешниеСистемы.Добавить(ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.Яндекс"));
		Если Объект.ВнешняяСистема = ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.OSM") Тогда
			Элементы.ГруппаАдресСервиса.Видимость = Истина; 
		ИначеЕсли Объект.ВнешняяСистема = ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.Яндекс") Тогда
			Элементы.APIключ.Видимость = Истина;    
			Элементы.APIключ.Заголовок = Нстр("en = 'Cartography Key'; ru = 'Ключ картографии'");
		КонецЕсли;
	ИначеЕсли Объект.ТипСервиса = ПредопределенноеЗначение("Перечисление.уатТипыГеосервисов.Геокодирование") Тогда
		ДоступныеВнешниеСистемы.Добавить(ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.OSM"));
		ДоступныеВнешниеСистемы.Добавить(ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.Яндекс"));
		ДоступныеВнешниеСистемы.Добавить(ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.DaData"));
		
		Если Объект.ВнешняяСистема = ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.OSM") Тогда
			Элементы.ГруппаАдресСервиса.Видимость = Истина; 
		ИначеЕсли Объект.ВнешняяСистема = ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.Яндекс") Тогда
			Элементы.APIключ.Видимость = Истина;    
			Элементы.APIключ.Заголовок = Нстр("en = 'Geocoding key'; ru = 'Ключ геокодирования'"); 
		ИначеЕсли Объект.ВнешняяСистема = ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.DaData") Тогда
			Элементы.ГруппаАдресСервиса.Видимость = Истина; 

			Элементы.APIключ.Видимость = Истина;    
			Элементы.APIключ.Заголовок = Нстр("en = 'API key'; ru = 'API-ключ'");
			
			Элементы.ГруппаДополнительныйКлюч.Видимость	 = Истина;    
			Элементы.ДополнительныйКлюч.Заголовок		 = Нстр("en = 'Secret key'; ru = 'Секретный ключ'");
		КонецЕсли;
		
	ИначеЕсли Объект.ТипСервиса = ПредопределенноеЗначение("Перечисление.уатТипыГеосервисов.ПодсказкиАдресов") Тогда
		ДоступныеВнешниеСистемы.Добавить(ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.OSM"));
		ДоступныеВнешниеСистемы.Добавить(ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.Яндекс"));
		ДоступныеВнешниеСистемы.Добавить(ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.DaData"));
		
		Если Объект.ВнешняяСистема = ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.OSM") Тогда
			Элементы.ГруппаАдресСервиса.Видимость = Истина; 

		ИначеЕсли Объект.ВнешняяСистема = ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.Яндекс") Тогда
			Элементы.APIключ.Видимость = Истина;    
			Элементы.APIключ.Заголовок = Нстр("en = 'Geocoding key'; ru = 'Ключ геокодирования'"); 
		ИначеЕсли Объект.ВнешняяСистема = ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.DaData") Тогда
			Элементы.ГруппаАдресСервиса.Видимость = Истина; 

			Элементы.APIключ.Видимость = Истина;    
			Элементы.APIключ.Заголовок = Нстр("en = 'API key'; ru = 'API-ключ'");
		КонецЕсли;
		
	ИначеЕсли Объект.ТипСервиса = ПредопределенноеЗначение("Перечисление.уатТипыГеосервисов.ПостроениеМаршрутов") Тогда
		ДоступныеВнешниеСистемы.Добавить(ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.OSM"));
		ДоступныеВнешниеСистемы.Добавить(ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.Яндекс")); 
		
		Если Объект.ВнешняяСистема = ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.OSM") Тогда
			Элементы.ГруппаАдресСервиса.Видимость = Истина; 
			
			Элементы.ЗаполнитьПоУмолчанию.Видимость                              = Ложь;
			Элементы.ЗаполнитьПоУмолчаниюАдресПостроениеМаршрутов.Видимость      = Истина;
			Элементы.ЗаполнитьПоУмолчаниюАдресПостроениеМаршрутовРарус.Видимость = Истина
		ИначеЕсли Объект.ВнешняяСистема = ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.Яндекс") Тогда
			Элементы.APIключ.Видимость = Истина;    
			Элементы.APIключ.Заголовок = Нстр("en = 'API key'; ru = 'API-ключ'");
		КонецЕсли;
		
	ИначеЕсли Объект.ТипСервиса = ПредопределенноеЗначение("Перечисление.уатТипыГеосервисов.ПостроениеМаршрутовЖД") Тогда
		ДоступныеВнешниеСистемы.Добавить(ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.OSM"));
		Элементы.ГруппаАдресСервиса.Видимость = Истина;
		
	ИначеЕсли Объект.ТипСервиса = ПредопределенноеЗначение("Перечисление.уатТипыГеосервисов.Навигация") Тогда
		ДоступныеВнешниеСистемы.Добавить(ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.Яндекс"));
		
		Элементы.APIключ.Видимость = Истина; 
		Элементы.APIключ.Заголовок = Нстр("en = 'Navigator key'; ru = 'Ключ навигатора'");
		Элементы.ИдентификаторКлиента.Видимость = Истина; 
		Элементы.ИдентификаторКлиента.Заголовок = Нстр("en = 'Client ID'; ru = 'Идентификатор клиента'");

	ИначеЕсли Объект.ТипСервиса = ПредопределенноеЗначение("Перечисление.уатТипыГеосервисов.Маршрутизация") Тогда
		ДоступныеВнешниеСистемы.Добавить(ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.Яндекс"));
		Элементы.ТипАвторизации.Видимость = Истина;   
		Элементы.ФормаЛогированиеЗапросов.Видимость = Истина;
		Если Объект.ТипАвторизации = "OAuth-токен" Тогда
			Элементы.ГруппаДополнительныйКлюч.Видимость	 = Истина;
			Элементы.ДополнительныйКлюч.Заголовок 		 = Нстр("en = 'OAuth token'; ru = 'OAuth-токен'");  
			Элементы.ДополнительныйКлюч.ПодсказкаВвода	 = Нстр("en = 'OAuth routing token'; ru = 'OAuth-токен маршрутизации'");
			Элементы.ГруппаПолучитьOAuthтокен.Видимость	 = Истина;
			Элементы.ИдентификаторКлиента.Видимость		 = Истина;
			Элементы.ИдентификаторКлиента.Заголовок		 = Нстр("en = 'Company ID'; ru = 'ID компании'"); 
			Элементы.ИдентификаторКлиента.Подсказка		 = Нстр("en = 'The Company ID parameter in Yandex Routing from General Settings'; ru = 'Параметр Идентификатор компании в Яндекс Маршрутизация из Общих настроек'");
		Иначе
			Элементы.APIключ.Видимость        = Истина;
			Элементы.APIключ.Заголовок        = Нстр("en = 'API key'; ru = 'API-ключ'");
		КонецЕсли; 
		Элементы.APIключ.ПодсказкаВвода = ?(Объект.ТипАвторизации = "OAuth-токен",
		Нстр("ru = 'Ключ оптимизации'; en = 'Optimization key'"), Нстр("ru = 'Ключ маршрутизации и оптимизации'; en = 'Routing and Optimization Key'"));
	
	КонецЕсли;  
	
	Элементы.ГруппаИнформация.Видимость = Объект.ВнешняяСистема = ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.Яндекс")
		ИЛИ Объект.ВнешняяСистема = ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.DaData"); 
		
	ПараметрыВыбораВнешнейСистемы = Новый Массив();
	ПараметрВыбораВнешнейСистемы  = Новый ПараметрВыбора(
				"Отбор.Ссылка",
		    	    	Новый ФиксированныйМассив(ДоступныеВнешниеСистемы)
			);  
	ПараметрыВыбораВнешнейСистемы.Добавить(ПараметрВыбораВнешнейСистемы);
	Элементы.ВнешняяСистема.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораВнешнейСистемы);

КонецПроцедуры

&НаКлиенте
Процедура ЗапускПриложения(КодВозврата, ДополнительныйПараметр) Экспорт
	// Заглушка 
	Заглушка = Истина;
КонецПроцедуры

#КонецОбласти
